void Mission() {
  set_sensor_track_line(0, 15);  //ตั้งค่าจำนวนเซนเซอร์ที่ใช้วิ่ง 0 , 15 || 2 , 14 || 3 , 13 || 4 , 12

  //set_line_center(0);  // เดินธรรมดา เข้ากลางหุ่น
  set_line_center(1);  // เดินตามเส้น เข้ากลางหุ่น

  //TrackLineColor(0);
  TrackLineColor(BLACK);  // สีที่หุ่นยนต์วิ่ง BLACK / WHITE /////////  0 เส้นดำ // 1 เส้นขาว
  //TestMotor(); //คำสั่งทดสอบมอเตอร์ โดยหมุนซ้ายไปข้างหน้าก่อน แล้วค่อยหมุนขวาไปข้างหน้า
  ModeSpdPID(0, 100, -5);  //โหมดคิดเอง
  // ModeSpdPID(1, 100, -100); //แบบปกติพื้นฐานทั่วไป
  // ModeSpdPID(2, 60, 60); //โค้งเยอะๆ ตามความเร็ว
  // ModeSpdPID(3, 100, -5); //โหมดคิดเอง ถ้าใส่ speed 50 ค่าจะติดลบ -50
  // ModeSpdPID(4, 100, 0); //โหมดปกติพื้นฐานทั่วไป
  set_position_line(7500);  //ตั้งค่าเส้น

  // // >>________เขียนโค้ดหลังจากบรรทัดนี้________________<<<<

  // FFcm(30,40,'c');
  // MotorStop(300);
  // BBcm(30,40);

  // FFcmG(30,40,'c');
  // MotorStop(300);
  // BBcmG(30,40);

  




}  //_________________ห้ามลบ__________________________
