void Mission() {
  set_sensor_track_line(0, 15); //ตั้งค่าจำนวนเซนเซอร์ที่ใช้วิ่ง 0 , 15 || 2 , 14 || 3 , 13 || 4 , 12
  
  //TrackLineColor(0);    
  TrackLineColor(BLACK);      // สีที่หุ่นยนต์วิ่ง BLACK / WHITE /////////  0 เส้นดำ // 1 เส้นขาว
  //TestMotor(); //คำสั่งทดสอบมอเตอร์ โดยหมุนซ้ายไปข้างหน้าก่อน แล้วค่อยหมุนขวาไปข้างหน้า
  ModeSpdPID(0, 100, -5);  //โหมดคิดเอง
  // ModeSpdPID(1, 100, -100); //แบบปกติพื้นฐานทั่วไป
  // ModeSpdPID(2, 60, 60); //โค้งเยอะๆ ตามความเร็ว
  // ModeSpdPID(3, 100, -5); //โหมดคิดเอง ถ้าใส่ speed 50 ค่าจะติดลบ -50
  // ModeSpdPID(4, 100, 0); //โหมดปกติพื้นฐานทั่วไป


  // // >>________เขียนโค้ดหลังจากบรรทัดนี้________________<<<<





}  //_________________ห้ามลบ__________________________
