void Program2() {
  // >> คำสั่งเจอแยก 'l'/'L' = กลางหุ่นเลี้ยวซ้าย , 'r'/'R' = กลางหุ่นเลี้ยวขวา  , 'p'/'P' = ตรง     , 's'/'S' = หยุด
  // >> 'c'/'C' = กลางหุ่น , 'q' = หน้าเลี้ยวซ้าย , 'e' = หน้าเลี้ยวขวา ,'x' = ไม่ต้องทำอะไร

  // >> FFC(ความเร็ว, 'คำสั่งเจอแยก');  // วิ่งตามเส้น PID ไปด้านหน้าเจอแยกให้ทำตามคำสั่ง >>  ด้านเซนเซอร์ที่ใช้ เซนเซอร์คู่กลาง
  // >> FFL(ความเร็ว, 'คำสั่งเจอแยก');  // วิ่งตามเส้น PID ไปด้านหน้าเจอแยกให้ทำตามคำสั่ง >>  ด้านเซนเซอร์ที่ใช้ เซนเซอร์คู่ซ้าย
  // >> FFL0(ความเร็ว, 'คำสั่งเจอแยก');  // วิ่งตามเส้น PID ไปด้านหน้าเจอแยกให้ทำตามคำสั่ง >>  ด้านเซนเซอร์ที่ใช้ เซนเซอร์ริมซ้ายสุดตัวที่ 0
  // >> FFR(ความเร็ว, 'คำสั่งเจอแยก');  // วิ่งตามเส้น PID ไปด้านหน้าเจอแยกให้ทำตามคำสั่ง >>  ด้านเซนเซอร์ที่ใช้ เซนเซอร์คู่ขวา
  // >> FFR7(ความเร็ว, 'คำสั่งเจอแยก');  // วิ่งตามเส้น PID ไปด้านหน้าเจอแยกให้ทำตามคำสั่ง >>  ด้านเซนเซอร์ที่ใช้ เซนเซอร์ริมขวาสุดตัวที่ 7
  // >> FFNUM(ความเร็ว, 'คำสั่งเจอแยก', 0->7);  // วิ่งตามเส้น PID ไปด้านหน้าเจอแยกให้ทำตามคำสั่ง >> ตำแหน่งเซนเซอร์ที่ใช้จับแยก

  FFC(40, 'r');



  
}