void Program1() {  /// โปรแกรมการทำงานที่ 1
   /////////////////  Move (คำสั่งเคลื่อนที่) ////////////////////////
  // คำสั่งเคลื่อนที่ Move(ความเร็วมอเตอร์ซ้าย,ความเร็วมอเตอร์ขวา,เวลาที่ใช้);
  // Speed -> ความเร็ว 0-100
  // Time -> เวลาที่ใช้งาน หน่วย Millisecond >> 1000 = 1 วินาทีโดยประมาณ
  // ==========================================================
  // คำสั่งทดสอบมอเตอร์
  // -> ซ้ายเดิน ขวาหยุด -> ซ้ายหยุด ขวาเดิน -> ซ้าย ขวา หยุด
  // Move(20 , 0 , 500);
  // Move(0 , 20 , 500);
  // Move(0 , 0 , 500);


  //  คำสั่งทดสอบมอเตอร์  //
  Move(20, 0, 300);  //สั่งมอเตอร์ซ้าย
  MotorStop();       // หยุดการทำงานมอเตอร์
  delay(500);        // หน่วงเวลา 0.5 วินาที
  Move(0, 20, 300);  //สั่งมอเตอร์ขวา
  MotorStop();       // หยุดการทำงานมอเตอร์
}
